
FAQ_TEST_DATA = [
    (0, "Сутки — 400 рублей. Оплата курьеру — наличными или картой."),
    (1, "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."),
    (2, "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."),
    (3, "Только начиная с завтрашнего дня. Но скоро станем расторопнее."),
    (4, "Позвоните нам, и мы что-нибудь придумаем."),
    (5, "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."),
    (6, "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."),
    (7, "Да, обязательно. Всем самокатов! И Москве, и Московской области.")
]


ORDER_TEST_DATA = [
    {
        "entry_point": "top",
        "customer": {
            "name": "Иван",
            "lastname": "Иванов",
            "address": "ул. Пушкина, д. 10",
            "metro_station": "Сокольники",
            "phone": "+79991234567"
        },
        "rental": {
            "date": "15.12.2024",
            "period": "сутки",
            "color": "black",
            "comment": "Позвонить за час"
        }
    },
    {
        "entry_point": "bottom",
        "customer": {
            "name": "Мария",
            "lastname": "Петрова",
            "address": "пр. Мира, д. 25",
            "metro_station": "Комсомольская",
            "phone": "+79997654321"
        },
        "rental": {
            "date": "20.12.2024",
            "period": "трое суток",
            "color": "grey",
            "comment": "Оставить у двери"
        }
    }
]